<template>
  <!--注册协议-->
  <mt-popup
    class="agreement-layer"
    v-model="termsPopupVisible"
    popup-transition="popup-fade">
    <div class="agreement-content">
      <!--隐私政策-->
      <h4 class="agreement-title">一汽丰田官方商城服务协议</h4>
      <!--注册协议-->
      <div class="agreement-text">

        <p>欢迎您使用一汽丰田汽车销售有限公司（以下简称“一汽丰田”）运营的电商官方网站：<a href="https://mall.ftms.com.cn">https://mall.ftms.com.cn</a>（以下简称“一汽丰田官方商城”或“本商城”）提供的互联网信息服务及相关的软件、技术支持的电子商务平台服务。本用户服务协议（以下简称“本协议”）由您（以下或称“用户”）与一汽丰田共同缔结，具有合同效力，并适用于一汽丰田提供的所有网络服务。</p>

        <h5>一、协议内容及范围</h5>
        <p>•	本协议的内容包括协议正文及所有由一汽丰田已经或将来可能发布的各类规则，包括一汽丰田根据业务需要不时更新发布的修改版本。除非另有明确说明，下文中所称的本协议，其含义均应按照上述表述理解。除另行明确声明外，使用本商城平台提供的服务均受本协议约束。</p>
        <p>•	请您在使用一汽丰田官方商城提供的网络服务前认真阅读本协议各条款内容，免除或限制责任的条款将以粗体下划线标示，请您重点阅读。如您为无民事行为能力人或限制民事行为能力人，请在您监护人的指导下阅读本协议。如您完成全部注册程序、使用一汽丰田官方商城提供的网络服务时，即表示您已阅读、理解、同意并接受本协议全部条款的约束。</p>
        <p>•	本商城平台有权根据互联网发展需求不定期地修改更新本协议，并以网站公告形式进行公示，请您留意关注。如您不同意相关修改，可随时自主选择停止使用本商城平台服务。若您在本协议的修改版本公示3日后，仍继续使用本商城平台服务的，即表示您已经了解并完全接受本协议的修改版本。</p>

        <h5>二、本商城平台服务使用规范</h5>
        <p>•	在使用本商城平台服务过程中，您承诺遵守以下约定：</p>
        <p>•	您应当具有中华人民共和国法律规定的与您使用本商城平台的行为相适应的民事行为能力。</p>
        <p>•	您在使用本商城平台服务过程中实施的所有行为均应遵守国家法律法规之规定，并应不违背社会公共利益及公共道德，不损害他人的合法权益。</p>
        <p>•	不对本商城平台上的任何信息和数据做商业性利用，包括但不限于在未经本商城平台事先书面同意的情况下，以复制、传播等任何方式使用本商城平台上展示的信息、数据等。</p>
        <p>•	不使用任何装置、软件或例行程序干预或试图干预本商城平台的正常运作或正在本商城平台上进行的任何兑换、交易或活动。禁止采取任何将导致不合理的庞大数据负载加诸于本商城平台设备的行为。</p>

        <p>•	在本商城平台使用服务过程中，您已了解并同意：</p>
        <p>•	本商城平台有权对您是否违反上述承诺做出认定，并根据认定结果予以相应处理（包括但不限于中止、终止向您提供服务）。在终止服务时，本商城平台将会以短信或站内信的方式通知您，若您在获得通知后3日内未以有效的方式向本商城平台提出异议，即表示您已接受该认定及服务终止。</p>
        <p>•	对于用户在本商城平台上发布的涉嫌违法、侵权或违反本协议约定的信息，本商城平台将会以短信或站内信的方式告知后即予以删除，且保留追究其法律责任的权利。</p>
        <p>•	对于您在本商城平台上实施的行为，或虽未在本商城平台上实施但已经对平台及其他用户产生影响的行为，本商城平台有权认定您行为的性质及是否构成对本协议的违反，并保留追究法律责任的权利。</p>
        <p>•	如用户涉嫌违反法律法规或本协议约定的行为对任意第三方造成损害的，该用户应当以自己的名义独立承担全部法律责任，并应确保本商城平台免于因此遭受损失或增加费用支出。</p>
        <p>•	如用户涉嫌违反法律法规或者本协议约定的行为，使本商城平台遭受任何损失，或遭到任何第三方的索赔，或受到任何行政管理部门的处罚的，该用户应当赔偿因此给本商城平台造成的损失及（或）发生的费用，包括但不限于赔偿金、罚款、声誉损失、诉讼费、律师费用等。</p>

        <h5>三、第三方广告及内容</h5>
        <p>•	本商城平台在提供服务过程中有权通过各种方式投放各种商业性广告或其他任何类型的商业信息，您有权通过您注册时填写的手机号码或其他联系方式获取本商城平台向您发送的商品促销或其他相关商业信息。如您不愿意接收此类信息，您有权通过相应的设置功能进行退订。</p>
        <p>•	本商城平台提供的第三方（包括一汽丰田授权经销商及其他第三方）内容或通往第三方的链接，均由第三方自行发布，并由该第三方向您提供该产品的升级、维护、客服等后续工作，本商城平台无法逐一审查，您应当对该第三方的产品及服务信息自行甄别并承担风险。对于您经本商城平台向第三方购买、取得的任何第三方产品或服务，由该第三方对其产品的质量及服务问题承担全部责任，您了解并同意应向第三方主张与此相关的一切权利。</p>
        <p>•	您明确知悉并同意，根据实际情况变化，一汽丰田有权对本商城平台上的商品信息、车辆使用相关信息进行修改和更新，并可对此不作特别通知。一汽丰田秉承初心，为使网站内展示的商品参数、说明、价格、库存等商品信息及车辆使用相关信息尽可能准确、详尽、完整而不懈追求极致完美，但受限于互联网技术的发展水平等因素，相关信息可能会有一定的滞后或误差，您对此情形已充分知悉并完全理解，对于可能给您造成的损失或损害，一汽丰田不承担任何赔偿责任。</p>

        <h5>四、责任范围和责任限制</h5>
        <p>•	本商城平台将竭尽最大努力对服务水平进行不断优化完善，但我们无法保证本商城平台服务在适用性、持续性、准确性、可靠性等方面不存在任何错误或疏漏。</p>
        <p>•	除非法律法规明确要求，或出现以下情况，否则，本商城平台没有义务对所有用户的注册数据、商品（服务）信息、商品兑换行为以及与交易有关的其它事项进行事先审查：</p>
        <p>•	本商城平台有合理的理由认为特定用户及具体交易事项可能存在重大违法或违约情形的。</p>
        <p>•	本商城平台接到执法部门关于协助调查等的要求的。</p>
        <p>•	您了解并同意，本商城平台不对因下述任一情况而导致您的任何损害承担责任（包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失，无论本商城平台是否已被告知该等损害赔偿的可能性）：</p>
        <p>•	使用或未能使用本商城平台服务。</p>
        <p>•	第三方未经批准使用您的账户或更改您的信息数据。</p>
        <p>•	通过本商城平台服务兑换或获取任何商品、数据、信息或进行交易等行为或替代行为所产生的费用及损失。</p>
        <p>•	用户对本商城平台服务的误解。</p>
        <p>•	接受第三方提供的服务或产品而造成的纠纷或损失。</p>
        <p>•	任何非因本商城平台的原因而引起的与本商城平台服务有关的其它损失。</p>
        <p>•	因以下原因导致本商城平台不能提供服务或延迟提供服务，本商城平台免予承担责任：</p>
        <p>•	信息网络正常的设备维护或升级；</p>
        <p>•	信息网络连接故障，电脑、通讯或其他系统的故障，电力故障；</p>
        <p>•	地震、火灾、洪水、雷电、风暴、台风、爆炸、战争、罢工、劳动争议、暴乱、起义、骚乱、恐怖袭击、生产力或生产资料不足等不可抗力；</p>
        <p>•	政府行为、司法行政机关的命令等；</p>
        <p>•	病毒、木马、恶意程序攻击等第三方的作为或不作为。</p>

        <h5>五、协议终止</h5>
        <p>•	如您在使用本商城平台的过程中违反本协议约定，本商城平台有权进行调查、中止或终止向您提供部分或全部本商城平台服务，暂时或永久冻结、注销您的账户，且无须为此向您或任何第三方承担任何责任。如因此造成本商城平台或任何第三方损失的，您应以自己的名义自行承担相关法律责任。在中止、终止服务前，本商城平台将会以短信或站内信的方式通知您，若您在通知后3日内未以有效的方式向我们提出异议，即表示您已接受本商城平台所进行的处理。</p>
        <p>•	出现以下情况时，本商城平台有权直接以注销账户的方式终止本协议：</p>
        <p>•	用户死亡；</p>
        <p>•	盗用他人的个人信息或手机号码；</p>
        <p>•	注册用户时提供虚假信息（包括且不限于：盗用他人的个人信息或手机号码；使用非本人所有的实名登记手机号码；使用非本人购买或有权使用的车辆信息）；</p>
        <p>•	以非法手段（包括且不限于黑客攻击、使用外挂等）来积累或使用优惠；</p>
        <p>•	妨碍其他用户的正常使用；</p>
        <p>•	伪称是一汽丰田的工作人员或管理人员；</p>
        <p>•	擅自更改一汽丰田的计算机系统，或威胁侵入系统；</p>
        <p>•	擅自传播谣言，用各种手段来诋毁一汽丰田的名誉或妨碍一汽丰田或其经销商的正常营业；</p>
        <p>•	利用一汽丰田的产品及服务宣传垃圾广告；</p>
        <p>•	用户擅自更改、消除或毁损一汽丰田广告业务提供的各种信息；</p>
        <p>•	利用技术手段批量建立虚假账号；</p>
        <p>•	侵害一汽丰田以及第三者的知识产权；</p>
        <p>•	提交、发布虚假信息，或盗用他人资料、冒充、利用他人名义发布信息；</p>
        <p>•	传播淫秽、暴力、毒品、赌博等违法信息；</p>

        <p>•	本商城平台终止向用户提供服务后，其用户试图再次直接或间接或以他人名义注册为本商城平台用户；</p>
        <p>•	用户提供的手机号码不存在或无法接收信息，且没有其他方式可以与其本人进行联系；或本商城平台以其它联系方式通知用户更改手机号码，而用户在本商城平台通知后三天内仍未更改为有效的手机号码；</p>
        <p>•	本协议修改时，用户本人明示并通知本商城平台不愿接受本协议的修改版本；</p>
        <p>•	其它违反法律法规、违反本协议约定或本商城平台认为应当终止服务的情况。</p>
        <p>•	用户本人有权向本商城平台要求注销其个人账户，本商城平台审核同意后将注销该账户，届时用户与本商城平台的合同关系即终止。用户账户被注销后，本商城平台没有义务为其保留或披露账户中的任何信息，也没有义务向其或第三方转发任何用户未曾阅读或发送完毕的信息。</p>
        <p>•	用户本人与本商城平台达成合意终止本协议后，本商城平台仍享有下列权利：</p>
        <p>•	继续保存用户的注册信息及用户使用本商城平台服务期间所有兑换、参与活动及交易信息。</p>
        <p>•	如用户在使用本商城平台服务期间存在违法或违反本协议的行为的，本商城平台仍有权向其主张权利、要求其承担相应的赔偿责任。</p>

        <h5>六、隐私权政策</h5>
        <p>•	本商城平台将严格遵守中国相关法律法规及一汽丰田顾客隐私及个人信息保护相关方针政策，收集并妥善保存、使用您在使用本商城平台过程中提供的姓名、地址、电话号码、邮箱地址等能够识别您及您家庭成员身份的信息。</p>
        <p>•	本商城平台承诺仅在合法、正当、必要的范围内，在如下情形中使用您的个人信息：</p>
        <p>•	与您进行的交易；</p>
        <p>•	商品及服务的企划、开发、改善；</p>
        <p>•	发送与一汽丰田的产品、服务、宣传活动（包括但不限于汽车、保险等）相关的信息或通知（根据本协议第3条，在您设置退订的情况下，本商城平台不会发送商业性目的的上述信息或通知）；</p>
        <p>•	在产品企划、开发或提高服务质量及顾客满意度等方面，实施的各项调查；</p>
        <p>•	在必要的范围内向本商城平台授权的第三方服务提供者、本商城平台的第三方合作伙伴以及以上各方因向您提供各项服务之需要而委托的合作公司披露，于此情形下，本商城平台会严格督促各关联公司及合作公司遵守相关法律法规及本条约定，妥当保存、处理本商城平台所提供的用户个人信息；</p>
        <p>•	依照法律法规或司法、行政机关之要求进行披露；</p>
        <p>•	其他一汽丰田顾客隐私及个人信息保护相关方针政策或取得您个人信息时所明示的使用目的。</p>

        <h5>七、法律适用、管辖与其它</h5>
        <p>•	本协议之订立、效力、解释、变更、履行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用的国际商业惯例和（或）行业惯例。</p>
        <p>•	若本协议的任何条款在任何程度上被认定为无效或不可强制执行，则本协议其余部分不受此影响并应在适用法律允许的最大程度上予以执行。</p>
        <p>•	本协议执行过程中所产生的任何问题，本商城平台和用户之间秉承友好协商的原则进行解决。如因本协议产生之争议，应向一汽丰田所在地有管辖权的人民法院提起诉讼，通过诉讼最终解决争议。</p>

      </div>
    </div>
    <!--关闭按钮-->
    <div @click="termsPopupVisible = false" class="close-btn"><i class="iconfont icon-guanbi"></i></div>
  </mt-popup>
</template>

<script>
  export default {
    props: {
      'show': {
        type: Boolean,
        default: false
      }
    },
    data () {
      return {
        termsPopupVisible: this.show
      }
    },
    watch: {
      // 监听show改变
      show (val) {
        this.termsPopupVisible = val
      },
      termsPopupVisible (val) {
        if (!val) {
          // eslint-disable-next-line no-undef
          $('.bm-content').css({'overflow-y': 'auto'})
          this.$emit('close', {
            type: 'terms-service',
            show: val
          })
        } else {
          // eslint-disable-next-line no-undef
          $('.bm-content').css({'overflow-y': 'hidden'})
        }
      }
    }
  }
</script>
<style lang="scss">
  @import './sass/agreement';
</style>
